FV2410/E_0443.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

title
GPKE

6.32.1: AD: Geschäftsdatenanfrage von MSB an NB



end title
:<b>E_0443</b>;
note right
<b><i>Prüfende Rolle: NB
end note

if (<b>10: </b> Handelt es sich um einen MSB aus der Sparte Gas?) then (ja)
    if (<b>40: </b> Ist an der genannten Messlokation ein iMS verbaut?) then (ja)
    else (nein)
        :A02;
        note left
            Kein iMS verbaut
        endnote
        kill;
    endif
else (nein)
    if (<b>20: </b> Ist der MSB im angefragten Zeitraum der genannten Marktlokation, Messlokation bzw. Tranche zugeordnet?) then (ja)
    else (nein)
        if (<b>30: </b> Ist der MSB für den angefragten Zeitraum z. B. aufgrund einer Vollmacht berechtigt die angefragten Stammdaten zu erhalten?) then (ja)
        else (nein)
            :A01;
            note left
                Keine Berechtigung
            endnote
            kill;
        endif
    endif
endif
:Stammdaten versenden;
kill;

@enduml
